Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.0.23/samha0wb/atdf/ATSAMHA0G16WB.atdf
    <module name="DSU" id="U2209" version="2.0.3" caption="Device Service Unit">
      <register-group name="DSU" caption="Device Service Unit">
        <register name="CTRL" offset="0x0" rw="W" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="CRC" caption="32-bit Cyclic Redundancy Check" mask="0x4"/>
          <bitfield name="MBIST" caption="Memory Built-In Self-Test" mask="0x8"/>
          <bitfield name="CE" caption="Chip Erase" mask="0x10"/>
        </register>
        <register name="STATUSA" offset="0x1" rw="RW" size="1" initval="0x00" caption="Status A">
          <bitfield name="DONE" caption="Done" mask="0x1"/>
          <bitfield name="CRSTEXT" caption="CPU Reset Phase Extension" mask="0x2"/>
          <bitfield name="BERR" caption="Bus Error" mask="0x4"/>
          <bitfield name="FAIL" caption="Failure" mask="0x8"/>
          <bitfield name="PERR" caption="Protection Error" mask="0x10"/>
        </register>
        <register name="STATUSB" offset="0x2" rw="R" size="1" initval="0x10" caption="Status B">
          <bitfield name="PROT" caption="Protected" mask="0x1"/>
          <bitfield name="DBGPRES" caption="Debugger Present" mask="0x2"/>
          <bitfield name="DCCD0" caption="Debug Communication Channel 0 Dirty" mask="0x4"/>
          <bitfield name="DCCD1" caption="Debug Communication Channel 1 Dirty" mask="0x8"/>
          <bitfield name="HPE" caption="Hot-Plugging Enable" mask="0x10"/>
        </register>
        <register name="ADDR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Address">
          <bitfield name="ADDR" caption="Address" mask="0xFFFFFFFC"/>
        </register>
        <register name="LENGTH" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Length">
          <bitfield name="LENGTH" caption="Length" mask="0xFFFFFFFC"/>
        </register>
        <register name="DATA" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Data">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DCC" offset="0x10" rw="RW" size="4" count="2" initval="0x00000000" caption="Debug Communication Channel n">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DID" offset="0x18" rw="R" size="4" initval="0x1001158C" caption="Device Identification">
          <bitfield name="DEVSEL" caption="Device Select" mask="0xFF"/>
          <bitfield name="REVISION" caption="Revision" mask="0xF00"/>
          <bitfield name="DIE" caption="Die Identification" mask="0xF000"/>
          <bitfield name="SERIES" caption="Product Series" mask="0x3F0000"/>
          <bitfield name="FAMILY" caption="Product Family" mask="0xF800000"/>
          <bitfield name="PROCESSOR" caption="Processor" mask="0xF0000000"/>
        </register>
        <register name="ENTRY0" offset="0x1000" rw="R" size="4" initval="0x9F0FC002" caption="CoreSight ROM Table Entry 0">
          <bitfield name="EPRES" caption="Entry Present" mask="0x1"/>
          <bitfield name="FMT" caption="Format" mask="0x2"/>
          <bitfield name="ADDOFF" caption="Address Offset" mask="0xFFFFF000"/>
        </register>
        <register name="ENTRY1" offset="0x1004" rw="R" size="4" initval="0x00003002" caption="CoreSight ROM Table Entry 1">
        </register>
        <register name="END" offset="0x1008" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table End">
          <bitfield name="END" caption="End Marker" mask="0xFFFFFFFF"/>
        </register>
        <register name="MEMTYPE" offset="0x1FCC" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table Memory Type">
          <bitfield name="SMEMP" caption="System Memory Present" mask="0x1"/>
        </register>
        <register name="PID4" offset="0x1FD0" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 4">
          <bitfield name="JEPCC" caption="JEP-106 Continuation Code" mask="0xF"/>
          <bitfield name="FKBC" caption="4KB Count" mask="0xF0"/>
        </register>
        <register name="PID0" offset="0x1FE0" rw="R" size="4" initval="0x000000D0" caption="Peripheral Identification 0">
          <bitfield name="PARTNBL" caption="Part Number Low" mask="0xFF"/>
        </register>
        <register name="PID1" offset="0x1FE4" rw="R" size="4" initval="0x000000FC" caption="Peripheral Identification 1">
          <bitfield name="PARTNBH" caption="Part Number High" mask="0xF"/>
          <bitfield name="JEPIDCL" caption="Low part of the JEP-106 Identity Code" mask="0xF0"/>
        </register>
        <register name="PID2" offset="0x1FE8" rw="R" size="4" initval="0x00000009" caption="Peripheral Identification 2">
          <bitfield name="JEPIDCH" caption="JEP-106 Identity Code High" mask="0x7"/>
          <bitfield name="JEPU" caption="JEP-106 Identity Code is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="PID3" offset="0x1FEC" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 3">
          <bitfield name="CUSMOD" caption="ARM CUSMOD" mask="0xF"/>
          <bitfield name="REVAND" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="CID0" offset="0x1FF0" rw="R" size="4" initval="0x0000000D" caption="Component Identification 0">
          <bitfield name="PREAMBLEB0" caption="Preamble Byte 0" mask="0xFF"/>
        </register>
        <register name="CID1" offset="0x1FF4" rw="R" size="4" initval="0x00000010" caption="Component Identification 1">
          <bitfield name="PREAMBLE" caption="Preamble" mask="0xF"/>
          <bitfield name="CCLASS" caption="Component Class" mask="0xF0"/>
        </register>
        <register name="CID2" offset="0x1FF8" rw="R" size="4" initval="0x00000005" caption="Component Identification 2">
          <bitfield name="PREAMBLEB2" caption="Preamble Byte 2" mask="0xFF"/>
        </register>
        <register name="CID3" offset="0x1FFC" rw="R" size="4" initval="0x000000B1" caption="Component Identification 3">
          <bitfield name="PREAMBLEB3" caption="Preamble Byte 3" mask="0xFF"/>
        </register>
      </register-group>
    </module>
    <module name="EIC" id="U2217" version="1.0.1" caption="External Interrupt Controller">
      <register-group name="EIC" caption="External Interrupt Controller">
        <register name="CTRL" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x1" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x80"/>
        </register>
        <register name="NMICTRL" offset="0x2" rw="RW" size="1" initval="0x00" caption="Non-Maskable Interrupt Control">
          <bitfield name="NMISENSE" caption="Non-Maskable Interrupt Sense" mask="0x7" values="EIC_NMICTRL__NMISENSE"/>
          <bitfield name="NMIFILTEN" caption="Non-Maskable Interrupt Filter Enable" mask="0x8"/>
        </register>
        <register name="NMIFLAG" offset="0x3" rw="RW" size="1" atomic-op="clear:NMIFLAG" initval="0x00" caption="Non-Maskable Interrupt Flag Status and Clear">
          <bitfield name="NMI" caption="Non-Maskable Interrupt" mask="0x1"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="EXTINTEO0" caption="External Interrupt 0 Event Output Enable" mask="0x1"/>
          <bitfield name="EXTINTEO1" caption="External Interrupt 1 Event Output Enable" mask="0x2"/>
          <bitfield name="EXTINTEO2" caption="External Interrupt 2 Event Output Enable" mask="0x4"/>
          <bitfield name="EXTINTEO3" caption="External Interrupt 3 Event Output Enable" mask="0x8"/>
          <bitfield name="EXTINTEO4" caption="External Interrupt 4 Event Output Enable" mask="0x10"/>
          <bitfield name="EXTINTEO5" caption="External Interrupt 5 Event Output Enable" mask="0x20"/>
          <bitfield name="EXTINTEO6" caption="External Interrupt 6 Event Output Enable" mask="0x40"/>
          <bitfield name="EXTINTEO7" caption="External Interrupt 7 Event Output Enable" mask="0x80"/>
          <bitfield name="EXTINTEO8" caption="External Interrupt 8 Event Output Enable" mask="0x100"/>
          <bitfield name="EXTINTEO9" caption="External Interrupt 9 Event Output Enable" mask="0x200"/>
          <bitfield name="EXTINTEO10" caption="External Interrupt 10 Event Output Enable" mask="0x400"/>
          <bitfield name="EXTINTEO11" caption="External Interrupt 11 Event Output Enable" mask="0x800"/>
          <bitfield name="EXTINTEO12" caption="External Interrupt 12 Event Output Enable" mask="0x1000"/>
          <bitfield name="EXTINTEO13" caption="External Interrupt 13 Event Output Enable" mask="0x2000"/>
          <bitfield name="EXTINTEO14" caption="External Interrupt 14 Event Output Enable" mask="0x4000"/>
          <bitfield name="EXTINTEO15" caption="External Interrupt 15 Event Output Enable" mask="0x8000"/>
        </register>
